taurus-rendimiento.yml
execution:
  - scenario: recetasCoctel
    concurrency: 100
    ramp-up: 30s
    hold-for: 1m
  
  # - scenario: recetasCoctelheroku
  #   concurrency: 100
  #   ramp-up: 30s
  #   hold-for: 1m


scenarios:
  recetasCoctel:    
    default-address: http://localhost:8080
    timeout: 5s
    requests:
      - url: /recetas
        method: GET
        headers:
          Content-Type: application/json
  
          recetasCoctel:    
    default-address: http://localhost:3013
    timeout: 5s
    requests:
      - url: /recetas
        method: GET
        headers:
          Content-Type: application/json
   
  # recetasCoctelheroku:    
  #   default-address: https://recetacoctel.herokuapp.com/
  #   timeout: 5s
  #   requests:
  #     - url: /recetas
  #       method: GET
  #       headers:
  #         Content-Type: application/json